spec/cassettes/isb___daptor/consume___ublication/with_valid_arguments_read_publication_returns_a_valid_message.yml

--- 
http_interactions: 
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ChannelManagementService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:CreateChannel><ChannelURI>Test</ChannelURI><ChannelType>Publication</ChannelType></ins0:CreateChannel></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=r20zfiptcopg14msxv2df1ze
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/CreateChannel\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "488"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "260"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:34:59 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><CreateChannelResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:45 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:OpenPublicationSession><ChannelURI>Test</ChannelURI></ins0:OpenPublicationSession></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=qm21qsfrtroq55hf5d5lgjm2
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/OpenPublicationSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "468"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "360"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:35:00 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><OpenPublicationSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"><SessionID>ccd9b257-a19d-4205-919c-24376c642c58</SessionID></OpenPublicationSessionResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:47 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:PostPublication><SessionID>ccd9b257-a19d-4205-919c-24376c642c58</SessionID><MessageContent><CCOMData xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.mimosa.org/osa-eai/v3-2-3/xml/CCOM-ML"><Entity xsi:type="Asset"><GUID>C013C740-19F5-11E1-92B7-6B8E4824019B</GUID></Entity></CCOMData></MessageContent><Topic>topic</Topic><Expiry></Expiry></ins0:PostPublication></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=qm21qsfrtroq55hf5d5lgjm2
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/PostPublication\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "769"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "346"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:35:01 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><PostPublicationResponse xmlns="http://www.openoandm.org/xml/ISBM/"><MessageID>ed712645-e1d9-4c00-88bf-6fabaf370df1</MessageID></PostPublicationResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:48 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ConsumerPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:OpenSubscriptionSession><ChannelURI>Test</ChannelURI><Topic>topic</Topic></ins0:OpenSubscriptionSession></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=5fst4lldg4gtgx2qi2sq3udc
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/OpenSubscriptionSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "490"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "362"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:35:02 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><OpenSubscriptionSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"><SessionID>da9de324-8c27-41c0-8586-6ad4c982271a</SessionID></OpenSubscriptionSessionResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:49 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ConsumerPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:ReadPublication><SessionID>da9de324-8c27-41c0-8586-6ad4c982271a</SessionID></ins0:ReadPublication></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=5fst4lldg4gtgx2qi2sq3udc
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/ReadPublication\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "484"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "601"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:35:03 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><ReadPublicationResponse xmlns="http://www.openoandm.org/xml/ISBM/"><PublicationMessage><MessageID>ed712645-e1d9-4c00-88bf-6fabaf370df1</MessageID><MessageContent><CCOMData xmlns="http://www.mimosa.org/osa-eai/v3-2-3/xml/CCOM-ML"><Entity xsi:type="Asset"><GUID>C013C740-19F5-11E1-92B7-6B8E4824019B</GUID></Entity></CCOMData></MessageContent><Topic>topic</Topic></PublicationMessage></ReadPublicationResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:50 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:ClosePublicationSession><SessionID>ccd9b257-a19d-4205-919c-24376c642c58</SessionID></ins0:ClosePublicationSession></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=qm21qsfrtroq55hf5d5lgjm2
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/ClosePublicationSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "500"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "270"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:35:05 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><ClosePublicationSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:51 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ChannelManagementService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:DeleteChannel><ChannelURI>Test</ChannelURI></ins0:DeleteChannel></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=r20zfiptcopg14msxv2df1ze
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/DeleteChannel\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "450"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "260"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:35:06 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><DeleteChannelResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:52 GMT
recorded_with: VCR 2.2.5
